package Java;

//상속관계에서의 업캐스팅, 다운캐스팅 기본

//다형성

	/*	1. 	
	 * 		메소드 오버로딩 -> 	하나의 메소드 이름으로 여러개의 메소드를 만들어 놓을 수 있다.
	 *							단! 메소드의 매개변수 갯수를 달리하고, 매개변수의 타입을 달리 해야한다.
	 *		생성자 오버로딩
	 *		메소드 오버 라이딩 ->	메소드 이름은 동일하게 선언하되, 
	 *								메소드의 구현부만 재정의해서 새로운 메소드를 만듬						
	 */

//자바의 다형성은?
//	하나의 타입의 참조변수로 여러 타입의 자식객체를 참조 할 수 있도록 하는 것.

//구체적인 자바의 다형성은?
//	조상클래스 타입의 참조변수로 자손클래스의 인스턴스를 참조할 수 있도록 하는 것.

//ex)
class Tv { // 조상클래스(부모클래스)

	// 변수
	boolean power; // 전원 상태를 저장할 변수(on/off 상태를 저장)
	int channel;

	// 전원을 키고 끄는 기능을 하는 메소드
	void power() {
		power = !power;
	}

	// 채널을 1 증가시키는 기능의 메소드
	void channelUp() {
		++channel;
	}

	// 채널을 1 감소시키는 기능의 메소드
	void channelDown() {
		--channel;
	}
}

// TV기능 + 캡션 기능을 추가시킨 CaptionTv클래스
class CaptionTv extends Tv {

	// 캡션을 보여주기 위한 문자열
	String text;

	void caption() {
		System.out.println("캡션 기능이 추가된 TV");
	}

}

public class Ex1 {

	public static void main(String[] args) { // 선언부

		/*
		 * 지금까지는 생성된 객체를 다루기 위해서 객체의 타입과 일치하는 클래스 타입의 참조변수만 사용했었다. Tc객체를 다루기 위해서
		 * Tv클래스 타입의 참조변수를 선언하고, CaptionTv객체를 다루기 위해서 CaptionTv클래스 타입의 참조변소를
		 * 선언했었다.
		 */
			Tv t = new Tv();
			CaptionTv c = new CaptionTv();

		/*
		 * 그러나.. Tv클래스와 CaptionTv클래스가 상속관계에 있을 경우, 조상클래스 타입의 참조변수로 -> 자손클래스 타입의
		 * 객체를 참조하도록 하는 것도 가능하다. 조상클래스 타입(Tv클래스타입)의 참조변수에 자손 객체(new
		 * CaptionTv();)를 저장할 수 있다.
		 */
			Tv t1 = new CaptionTv(); // 업캐스팅(자손 -> 조상)

		/*
		 * 그러면 이제 객체를 같은 클래스 타입의 참조변수로 참조하는 것과 조상 클래스타입의 참조변수로 참조하는것의 차이를 알아보자.
		 */
		// 1. 같은 클래스 타입의 참조변수로 객체 생성하여 참조
			CaptionTv c1 = new CaptionTv();

		// c1참조변수로 참조할 수 있는 멤버(변수, 메소드)
			c1.power = true;
			c1.channel = 0;
			c1.power();
			c1.channelUp();
			c1.channelDown();
	
			c1.text = "captionTv";
			c1.caption();

		// 2. 조상클래스 타입의 참조변수로 자식객체를 생성하여 참조
			Tv t2 = new CaptionTv();

		// t2참조변수로 참조할 수 있는 멤버
			t2.power = true;
			t2.channel = 0;
			t2.power();
			t2.channelUp();
			t2.channelDown();

		 // t2.text = "captionTv"; //참조 불가능
		 // t2.caption(); //참조 불가능
		/*
		 * 실제 객체가 CaptionTv클래스 타입이라 할지라도, 참조변수 t2로는 CaptionTv객체의 모든 멤버를 사용할 수
		 * 없다. 이유는? Tv클래스 타입의 참조변수로는 CaptionTv객체의 멤버 중에서 Tv클래스의 멤버들만 사용할 수 있기
		 * 때문에...
		 */

		// ---------------------------------------------------------------------------------------------------------------//

		// 반대로 자손타입의 참조변수로 -> 조상타입의 객체를 참조? (불가능)
		// CaptionTv c2 = new Tv(); //컴파일 에러 발생
		/*
		 * 이유 : 실제 Tv객체 멤버 개수보다 CaptionTv클래스 타입의 참조변수 c2가 사용할 수 있는 개수가 더 많기 때문.
		 * 요약 : CaptionTv클래스 타입의 c2변수가 참조하고 있는 객체는 tv클래스 타입이고, tv클래스 타입의 객체에는
		 * text변수와 caption()메소드가 존재하지 않기 때문. 결론 : 자손타입의 참조변수로 조상타입의 객체를 참조하는 것은?
		 * 존재하지 않는 멤버를 사용하고자 할 가능성이 있으므로 허용하지 않는다.
		 */

	}

}
